app/views/children/show.html.erb


<% @child.attendances.each do |a| %>
---
SELECT "attendances".* FROM "attendances" WHERE "attendances"."child_id" = ?  [["child_id", 1]]