app/controllers/attendances_controller.rb

SELECT "attendances".* FROM "attendances"
---
  def index
    @attendances = Attendance.all

SELECT  "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
     @provider = Provider.find(params[:provider_id])

INSERT INTO "attendances" ("child_id", "provider_id", "absent", "whoCreated", "whoEdited", "childTermDate", "dateOfService", "timeIn", "timeOut", "dateCreated", "dateEdited", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @provider = Provider.find(params[:provider_id])
    @child = Child.find(params[:child_id])
    @attendance = @child.attendances.create(attendance_params)

SELECT  "attendances".* FROM "attendances" WHERE "attendances"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_attendance
      @attendance = Attendance.find(params[:id])