app/controllers/children_controller.rb

  def index
    if params[:provider_id] != nil
      # for specific provider view
       @provider = Provider.find(params[:provider_id])
       @children = @provider.children.order('"lName"')
---
SELECT "children".* FROM "children"

  def create
    if params[:provider_id]
       @provider = Provider.find(params[:provider_id])
       @child = @provider.children.create(child_params)
---
INSERT INTO "children" ("fName", "middle", "lName", "fundSrc", "trans", "provider_id", "dob", "startDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)