app/controllers/providers_controller.rb

SELECT "providers".* FROM "providers"
---
  def index
    @providers = Provider.order('"lName"').all

INSERT INTO "providers" ("fName", "middle", "lName", "addr1", "addr2", "city", "state", "phone", "email", "certLevel", "sqOneRepl", "licenseExpDate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @provider = Provider.new(provider_params)

    respond_to do |format|
      if @provider.save

SELECT  "providers".* FROM "providers" WHERE "providers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_provider
      @provider = Provider.find(params[:id])